In [1]:
import pandas as pd

## .pivot()

In [18]:
# read and show the dataset
df_gdp = pd.read_csv('gdp.csv')
df_gdp.head(3)

   unid wbid      country  year        SES      gdppc  yrseduc  popshare
0     4  AFG  Afghanistan  1970   3.474212  709.00000      NaN  0.003097
1     4  AFG  Afghanistan  1920  26.968016  731.75677      NaN  0.003245
2     4  AFG  Afghanistan  1990   1.269530  604.00000      NaN  0.002347

In [60]:
# reshape the dataframe with .pivot()
df_gdp_pivot = df_gdp.pivot(index='year', columns='country', values='gdppc')
df_gdp_pivot

country,Afghanistan,Albania,Algeria,Angola,Argentina,Armenia,Australia,Austria,Bahrain,Bangladesh,...,Togo,Tonga,Trinidad & Tobago,Tunisia,Turkey,Uganda,Ukraine,United Arab Emirates,United Kingdom,Uruguay
year,,,,,,,,,,,,,,,,,,,,,
1880,585.46509,522.00000,819.18604,533.66669,1731.500,1041.0000,4285.000,2079.000,811.76746,566.66669,...,533.66669,585.46509,583.33331,691.13953,915.23254,533.66669,1041.0000,811.76746,3477.000,2082.0000
1890,635.93024,598.00000,923.37207,567.33331,2152.000,1139.0000,4458.000,2443.000,881.53491,587.33331,...,567.33331,635.93024,680.66669,749.27905,1005.46510,567.33331,1139.0000,881.53491,4009.000,NaN
1900,686.39532,685.00000,1027.55810,601.00000,2756.000,1237.0000,4013.000,2882.000,951.30231,608.00000,...,601.00000,686.39532,778.00000,807.41858,1095.69760,601.00000,1237.0000,951.30231,4492.000,NaN
1910,736.86047,780.00000,1131.74410,628.69232,3822.000,1430.0769,5210.000,3290.000,1021.06980,661.84613,...,628.69232,736.86047,978.00000,865.55817,1185.93020,628.69232,1430.0769,1021.06980,4611.000,3136.0000
1920,731.75677,861.31250,1201.21620,682.62964,3473.000,1432.9333,4766.000,2412.000,1242.91890,651.89191,...,682.62964,871.75677,1536.70280,926.89191,862.29999,682.62964,1432.9333,3833.67580,4548.000,NaN
1930,702.83783,929.57141,1255.81080,747.81482,4080.000,1448.0000,4708.000,3586.000,1529.94590,614.59460,...,747.81482,1042.83790,2249.13530,989.59460,1249.00000,747.81482,1448.0000,7821.78370,5441.000,4301.0000
1940,673.91895,965.28571,1310.40540,813.00000,4161.000,2144.0000,6166.000,3959.000,1816.97300,577.29730,...,813.00000,1213.91890,2961.56760,1052.29720,1675.00000,813.00000,2144.0000,11809.89200,6856.000,3661.0000
1950,645.00000,1001.00000,1365.00000,1052.00000,4987.000,2841.0000,7412.000,3706.000,2104.00000,540.00000,...,574.00000,1385.00000,3674.00000,1115.00000,1623.00000,687.00000,2841.0000,15798.00000,6939.000,NaN
1960,739.00000,1451.00000,2088.00000,1253.00000,5559.000,3945.0000,8791.000,6519.000,2843.00000,545.00000,...,698.00000,1632.00000,6251.00000,1343.00000,2247.00000,713.00000,3945.0000,22433.00000,8645.000,4960.0000
1970,709.00000,2004.00000,2249.00000,1768.00000,7302.000,5575.0000,12024.000,9747.000,3788.00000,630.00000,...,1075.00000,2082.00000,8244.00000,1827.00000,3078.00000,867.00000,5575.0000,24552.00000,10767.000,5184.0000
1980,690.00000,2347.00000,3152.00000,961.00000,8206.000,6116.5884,14412.000,13759.000,4388.00000,549.00000,...,1097.00000,2522.00000,12380.00000,2944.00000,4022.00000,572.00000,5378.1763,27709.00000,12931.000,6555.0000
1990,604.00000,4557.40820,10238.88400,4806.43020,10833.503,3735.5432,28572.076,31265.287,35112.55500,1290.43100,...,1350.13260,3574.23320,12255.37400,5614.93850,10953.98500,783.10931,10463.9600,114518.83000,26769.357,9840.7266
2000,565.00000,5470.01760,10211.10400,3831.00000,14924.374,2918.5576,35244.504,38812.051,44791.52000,1645.71730,...,1302.04220,4610.38770,18324.01600,7573.93310,13357.62400,1077.69560,4797.3804,107206.46000,32961.527,12874.7760
2010,1662.80350,9927.17580,12898.29600,6492.17680,18794.270,6507.9146,41363.215,43174.977,39912.69500,2451.30520,...,1229.47550,4993.00000,31261.02500,10437.08900,17076.60500,1573.47140,7824.4985,57406.73800,36195.867,17082.4100

## .pivot_table()

In [22]:
# read and show the dataset
df_sales = pd.read_excel('supermarket_sales.xlsx')
df_sales
df_sales.head()

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
0,750-67-8428,A,Yangon,Member,Female,Health and beauty,74.69,7,26.1415,548.9715,2019-01-05,13:08:00,Ewallet,522.83,4.761905,26.1415,9.1
1,226-31-3081,C,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3.8200,80.2200,2019-03-08,10:29:00,Cash,76.40,4.761905,3.8200,9.6
2,631-41-3108,A,Yangon,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,2019-03-03,13:23:00,Credit card,324.31,4.761905,16.2155,7.4
3,123-19-1176,A,Yangon,Member,Male,Health and beauty,58.22,8,23.2880,489.0480,2019-01-27,20:33:00,Ewallet,465.76,4.761905,23.2880,8.4
4,373-73-7910,A,Yangon,Normal,Male,Sports and travel,86.31,7,30.2085,634.3785,2019-02-08,10:37:00,Ewallet,604.17,4.761905,30.2085,5.3

In [28]:
# make a pivot table, add an aggregate function and select some columns 
df_sales.pivot_table(index='Gender',
                     values=['Quantity', 'Total'],
                     aggfunc='sum').round(1)

        Quantity     Total
Gender
Female      2869  167882.9
Male        2641  155083.8

In [30]:
# make a pivot tables that says how much male and female spend in each category
df_sales.pivot_table(index='Gender',
                     columns='Product line',
                     values='Total',
                     aggfunc='sum').round(1)

Product line,Electronic accessories,Fashion accessories,Food and beverages,Health and beauty,Home and lifestyle,Sports and travel
Gender,,,,,,
Female,27102.0,30437.4,33170.9,18561.0,30036.9,28574.7
Male,27235.5,23868.5,22973.9,30632.8,23825.0,26548.1